
* `Series.str.lower()`
* `Series.str.upper()`
* `Series.str.len()`
* `Index.str.strip()`
    - `Index.str.lstrip()`
    - `Index.str.rstrip()`
    - `df.columns.str.strip()`
    - `df.columns.str.lstrip()`
    - `df.columns.str.rstrip()`
* `Series.str.split('', expand = True, n = 1)`
    - `.str.get()`
    - `Series.str[]`
* `Series.str.replace(pat, string, regex = False)`
    - `Series.str.replace(pat, repl)`
* `Series.str.cat()`
* `Series.str.contains()`
* `Series.str.match()`
* `Series.str.startwith()`
* `Series.str.endwith()`
* `Series.str.extract()`
* `Series.str.extractall()`
* `Series.str.get_dummies()`

In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

### `Series.str.lower()`, `Series.str.upper()`

In [3]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [4]:
s.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

### `Series.str.len()`

In [5]:
s.str.len()

0    1.0
1    1.0
2    1.0
3    4.0
4    4.0
5    NaN
6    4.0
7    3.0
8    3.0
dtype: float64

### `Index.str.strip()`, `Index.str.lstrip()`, `Index.str.rstrip()`

In [6]:
idx = pd.Index([' jack', 'jill ', ' jesse', 'frank'])
idx

Index([' jack', 'jill ', ' jesse', 'frank'], dtype='object')

In [7]:
idx.str.strip()

Index(['jack', 'jill', 'jesse', 'frank'], dtype='object')

In [8]:
idx.str.lstrip()

Index(['jack', 'jill ', 'jesse', 'frank'], dtype='object')

In [9]:
idx.str.rstrip()

Index([' jack', 'jill', ' jesse', 'frank'], dtype='object')

In [10]:
df = pd.DataFrame(np.random.randn(3, 2), 
                  columns = [' Column A', ' Column B'],
                  index = range(3))
df

    Column A   Column B
0   0.233762  -0.012010
1   0.363440  -1.195394
2  -0.271686   1.488137

In [11]:
df.columns.str.strip()

Index(['Column A', 'Column B'], dtype='object')

In [12]:
df.columns \
    .str.lower() \
    .str.strip()

Index(['column a', 'column b'], dtype='object')

In [13]:
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_')
df

   column_a  column_b
0  0.233762 -0.012010
1  0.363440 -1.195394
2 -0.271686  1.488137

### `Series.str.split(,expand = True, n = 1)`, `.str.get()`, `.str[]`, `Series.str.rsplit(, expand = True, n = 1)`

In [14]:
s2 = pd.Series(['a_b_c', 'c_d_e', np.nan, 'f_g_h'])
s2

0    a_b_c
1    c_d_e
2      NaN
3    f_g_h
dtype: object

In [15]:
s2.str.split('_')

0    [a, b, c]
1    [c, d, e]
2          NaN
3    [f, g, h]
dtype: object

In [16]:
s2.str.split('_').str.get(0)

0      a
1      c
2    NaN
3      f
dtype: object

In [17]:
s2.str.split('_').str.get(1)

0      b
1      d
2    NaN
3      g
dtype: object

In [18]:
s2.str.split('_').str.get(2)

0      c
1      e
2    NaN
3      h
dtype: object

In [19]:
s2.str.split('_').str[0]

0      a
1      c
2    NaN
3      f
dtype: object

In [20]:
s2.str.split('_').str[1]

0      b
1      d
2    NaN
3      g
dtype: object

In [21]:
s2.str.split('_').str[2]

0      c
1      e
2    NaN
3      h
dtype: object

In [22]:
s2.str.split('_', expand = True)

     0    1    2
0    a    b    c
1    c    d    e
2  NaN  NaN  NaN
3    f    g    h

In [23]:
s2.str.split('_', expand = True, n = 1)

     0    1
0    a  b_c
1    c  d_e
2  NaN  NaN
3    f  g_h

In [24]:
s2.str.rsplit('_', expand = True, n = 1)

     0    1
0  a_b    c
1  c_d    e
2  NaN  NaN
3  f_g    h

### `Serise.str.repalce(, , case = False, regex = False)`

In [25]:
s3 = pd.Series(['A', 'B', 'C', 
                'Aaba', 'Baca', '', np.nan, 
                'CABA', 'dog', 'cat'])
s3

0       A
1       B
2       C
3    Aaba
4    Baca
5
6     NaN
7    CABA
8     dog
9     cat
dtype: object

In [26]:
s3.str.replace('^.a|dog', 'XX-XX', case = False)

0          A
1          B
2          C
3    XX-XXba
4    XX-XXca
5
6        NaN
7    XX-XXBA
8      XX-XX
9     XX-XXt
dtype: object

In [27]:
dollars = pd.Series(['12', '-$10', '$10,000'])
dollars

0         12
1       -$10
2    $10,000
dtype: object

In [28]:
dollars.str.replace('$', '')

0        12
1       -10
2    10,000
dtype: object

In [29]:
dollars.str.replace('-$', '-')

0         12
1       -$10
2    $10,000
dtype: object

In [31]:
dollars.str.replace(r'-\$', '-')

0         12
1        -10
2    $10,000
dtype: object

In [33]:
dollars.str.replace('-$', '-', regex = False)

0         12
1        -10
2    $10,000
dtype: object

In [36]:
pat = r'[a-z0-9]+'
def repl(m):
    return m.group(0)[::-1]

s4 = pd.Series(['foo 123', 'bar baz', np.nan])
s4

0    foo 123
1    bar baz
2        NaN
dtype: object

In [37]:
s4.str.replace(pat, repl)

0    oof 321
1    rab zab
2        NaN
dtype: object

In [38]:
pat = r'(?P<one>\w+) (?P<two>\w+) (?P<three>\w+)'
def repl(m):
    return m.group('two').swapcase()
s5 = pd.Series(['Foo Bar Baz', np.nan])
s5

0    Foo Bar Baz
1            NaN
dtype: object

In [39]:
s5.str.replace(pat, repl)

0    bAR
1    NaN
dtype: object

In [41]:
s3

0       A
1       B
2       C
3    Aaba
4    Baca
5
6     NaN
7    CABA
8     dog
9     cat
dtype: object

In [40]:
import re
regex_pat = re.compile(r'.a|dog', flags = re.IGNORECASE)
s3.str.replace(regex_pat, 'XX-XX')

0             A
1             B
2             C
3    XX-XXXX-XX
4    XX-XXXX-XX
5
6           NaN
7    XX-XXXX-XX
8         XX-XX
9        XX-XXt
dtype: object

### `Series.str.cat(, sep, na_rep = '')`, `Series.str.cat(list, join = 'left', na_rep = '')`,  `Index.str.cat()`

In [42]:
s = pd.Series(['a', 'b', 'c', 'd'])
s

0    a
1    b
2    c
3    d
dtype: object

In [43]:
s.str.cat(sep = ',')

'a,b,c,d'

In [44]:
s.str.cat(sep = '')

'abcd'

In [45]:
t = pd.Series(['a', 'b', np.nan, 'd'])
t

0      a
1      b
2    NaN
3      d
dtype: object

In [46]:
t.str.cat(sep = ',')

'a,b,d'

In [47]:
t.str.cat(sep = ',', na_rep = '-')

'a,b,-,d'

In [48]:
s.str.cat(['A', 'B', 'C', 'D'])

0    aA
1    bB
2    cC
3    dD
dtype: object

In [49]:
s.str.cat(t)

0     aa
1     bb
2    NaN
3     dd
dtype: object

In [50]:
s.str.cat(t, na_rep = '-')

0    aa
1    bb
2    c-
3    dd
dtype: object

In [54]:
d = pd.concat([t, s], axis = 1)
d

     0  1
0    a  a
1    b  b
2  NaN  c
3    d  d

In [55]:
s.str.cat(d, na_rep = '-')

0    aaa
1    bbb
2    c-c
3    ddd
dtype: object

In [59]:
u = pd.Series(['b', 'd', 'a', 'c'], index = [1, 3, 0, 2])
u

1    b
3    d
0    a
2    c
dtype: object

In [60]:
s

0    a
1    b
2    c
3    d
dtype: object

In [57]:
s.str.cat(u)

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: A future version of pandas will perform index alignment when `others` is a Series/Index/DataFrame (or a list-like containing one). To disable alignment (the behavior before v.0.23) and silence this warning, use `.values` on any Series/Index/DataFrame in `others`. To enable alignment and silence this warning, pass `join='left'|'outer'|'inner'|'right'`. The future default will be `join='left'`.
  """Entry point for launching an IPython kernel.

0    ab
1    bd
2    ca
3    dc
dtype: object

In [58]:
s.str.cat(u, join = 'left')

0    aa
1    bb
2    cc
3    dd
dtype: object

In [61]:
v = pd.Series(['z', 'a', 'b', 'd', 'e'], 
              index = [-1, 0, 1, 3, 4])
v

-1    z
 0    a
 1    b
 3    d
 4    e
dtype: object

In [62]:
s

0    a
1    b
2    c
3    d
dtype: object

In [65]:
s.str.cat(v,  join = 'left', na_rep = '-')

0    aa
1    bb
2    c-
3    dd
dtype: object

In [67]:
s.str.cat(v, join = 'right', na_rep = '-')

-1    -z
 0    aa
 1    bb
 3    dd
 4    -e
dtype: object

In [68]:
s.str.cat(v, join = 'inner', na_rep = '-')

0    aa
1    bb
3    dd
dtype: object

In [64]:
s.str.cat(v, join = 'outer', na_rep = '-')

-1    -z
 0    aa
 1    bb
 2    c-
 3    dd
 4    -e
dtype: object

In [69]:
s

0    a
1    b
2    c
3    d
dtype: object

In [70]:
u

1    b
3    d
0    a
2    c
dtype: object

In [71]:
s.str.cat([u, u.to_numpy()], join = 'left')

0    aab
1    bbd
2    cca
3    ddc
dtype: object

In [72]:
v

-1    z
 0    a
 1    b
 3    d
 4    e
dtype: object

In [74]:
s.str.cat([v, u, u.to_numpy()], join = 'outer', na_rep = '-')

-1    -z--
 0    aaab
 1    bbbd
 2    c-ca
 3    dddc
 4    -e--
dtype: object

In [75]:
u.loc[[3]]

3    d
dtype: object

In [76]:
v.loc[[-1, 0]]

-1    z
 0    a
dtype: object

In [77]:
s.str.cat([u.loc[[3]], v.loc[[-1, 0]]], join = 'right', na_rep = '-')

-1    --z
 0    a-a
 3    dd-
dtype: object

### `Series.str[]`

In [78]:
s = pd.Series(['A', 'B', 'C', 'AaBa', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    AaBa
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [79]:
s.str[0]

0      A
1      B
2      C
3      A
4      B
5    NaN
6      C
7      d
8      c
dtype: object

In [80]:
s.str[1]

0    NaN
1    NaN
2    NaN
3      a
4      a
5    NaN
6      A
7      o
8      a
dtype: object

In [81]:
s.str[2]

0    NaN
1    NaN
2    NaN
3      B
4      c
5    NaN
6      B
7      g
8      t
dtype: object

In [82]:
s.str[3]

0    NaN
1    NaN
2    NaN
3      a
4      a
5    NaN
6      A
7    NaN
8    NaN
dtype: object

In [83]:
s.str[4]

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
6   NaN
7   NaN
8   NaN
dtype: float64

In [84]:
s.str[5]

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
6   NaN
7   NaN
8   NaN
dtype: float64

### `Series.str.extract()`, `Series.str.extractall()`

In [86]:
s = pd.Series(['a1', 'b2', 'c3'])
s

0    a1
1    b2
2    c3
dtype: object

In [87]:
s.str.extract(r'([ab])(\d)', expand = False)

     0    1
0    a    1
1    b    2
2  NaN  NaN

In [88]:
s.str.extract(r'(?P<letter>[ab])(?P<digit>\d)', expand = False)

  letter digit
0      a     1
1      b     2
2    NaN   NaN

In [90]:
s.str.extract(r'[ab](\d)', expand = True)

     0
0    1
1    2
2  NaN

In [91]:
s.str.extract(r'[ab](\d)', expand = False)

0      1
1      2
2    NaN
dtype: object

In [93]:
s = pd.Series(['a1', 'b2', 'c3'], index = ['A11', 'B22', 'C33'])
s

A11    a1
B22    b2
C33    c3
dtype: object

In [94]:
s.index.str.extract('(?P<letter>[a-zA-Z])', expand = True)

  letter
0      A
1      B
2      C

In [95]:
s.index

Index(['A11', 'B22', 'C33'], dtype='object')

In [96]:
s.index.str.extract('(?P<letter>[a-zA-Z])', expand = False)

Index(['A', 'B', 'C'], dtype='object', name='letter')

In [98]:
s.index.str.extract('(?P<letter>[a-zA-Z])(?P<digit>[0-9]+)', expand = True)

  letter digit
0      A    11
1      B    22
2      C    33

In [99]:
s = pd.Series(['a1a2', 'b1', 'c1'], index = ['A', 'B', 'C'])
s

A    a1a2
B      b1
C      c1
dtype: object

In [103]:
two_groups = '(?P<letter>[a-z])(?P<digit>[0-9])'
s.str.extract(two_groups, expand = True)

  letter digit
A      a     1
B      b     1
C      c     1

In [104]:
s.str.extractall(two_groups)

        letter digit
  match
A 0          a     1
  1          a     2
B 0          b     1
C 0          c     1

### `Serise.str.contains(pattern)`, `Series.str.match(pattern)`, `Series.str.startwith()`, `Series.str.endwith()`

In [106]:
pattern = r'[0-9][a-z]'
s = pd.Series(['1', '2', '3a', '3b', '03c'])
s

0      1
1      2
2     3a
3     3b
4    03c
dtype: object

In [108]:
s.str.contains(pattern)

0    False
1    False
2     True
3     True
4     True
dtype: bool

In [110]:
s.str.match(pattern)

0    False
1    False
2     True
3     True
4    False
dtype: bool

In [112]:
s6 = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s6

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [115]:
s6.str.contains('A', na = True)

0     True
1    False
2    False
3     True
4    False
5     True
6     True
7    False
8    False
dtype: bool

### `Series.str.get_dummies(sep = '')`

In [116]:
s = pd.Series(['a', 'a|b', np.nan, 'a|c'])
s

0      a
1    a|b
2    NaN
3    a|c
dtype: object

In [117]:
s.str.get_dummies(sep = '|')

   a  b  c
0  1  0  0
1  1  1  0
2  0  0  0
3  1  0  1

In [118]:
idx = pd.Index(['a', 'a|b', np.nan, 'a|c'])
idx

Index(['a', 'a|b', nan, 'a|c'], dtype='object')

In [119]:
idx.str.get_dummies(sep = '|')

MultiIndex(levels=[[0, 1], [0, 1], [0, 1]],
           codes=[[1, 1, 0, 1], [0, 1, 0, 0], [0, 0, 0, 1]],
           names=['a', 'b', 'c'])